# 7 -  <!-- omit in toc -->

> Лабораторная работа 7 для студентов курса "Программирование на основе классов и шаблонов" 2 семестра кафедры ИУ5 МГТУ им Н.Э. Баумана.

## Содержание <!-- omit in toc -->

- [Цель работы](#цель-работы)
- [Начало работы](#начало-работы)
- [Задание](#задание)
- [Класс `Term`](#класс-term)
- [Класс `Polynomial`](#класс-polynomial)
- [Пример](#пример)
- [Требования к оформлению](#требования-к-оформлению)
- [Контрольные вопросы](#контрольные-вопросы)

## Цель работы

- Разработать классы для представления полиномов;
- Освоить перегрузку операторов ввода/вывода;
- Закрепить навыки работы с динамической памятью;
- Научиться разбирать строковые выражения;
- Закрепить принципы объектно-ориентированного программирования.

## Начало работы

Зайдите в свою локальную директорию с репозиторием для выполнения лабораторных работ. Заберите ветку с соответствующей лабораторной работой из общего репозитория:

```sh
git pull upstream
```

**или**

```sh
git pull upstream lab_7
```

Переключитесь на ветку с текущей лабораторной работой:

```sh
git checkout lab_7
```

Свяжите ветку локального репозитория с вашим удаленным репозиторием:

```sh
git push --set-upstream origin lab_7
```

## Задание

Написать программу ввода и оперирования `полиномами`, состоящими из `термов`. Необходимо реализовать два класса:

- `Term` — одночлен;
- `Polynomial` — полином.

> ОСТОРОЖНО
>
> *В работе запрещено использование контейнеров STL (vector, list и др.).
> В данной работе можно использовать самостоятельно разработанный вектор из предыдущей работы.*

**Ввод полинома**

- `термы` `полинома` могут вводиться в любом порядке;
- во вводимом `терме` могут присутствовать отрицательные коэффициенты, *например:* `-1`;
- `терм` (член `полинома` одного порядка) может складываться с другим `термом`. Например: `3x^2 – x^2, -3x^2 + x^2`;
- пробелы при вводе могут появляться где угодно.

**Обратите внимание**, что по заданию вы должны уметь работать со строками такого вида:

```sh
3x^2 - x^2 -    3x^2 + x ^2 + 5x^5   - 4x^3 +x^2 - 7
```

Пробелы расставлены в случайном порядке.
Результат разбора такой строки - `полином`. Этот разбор вы можете сделать в перегрузке ввода у `полинома`. В рамках данной перегрузки строку нужно сначала разобрать на `термы`, потом `термы` сложить, и получить `полином`. При сложении вы можете вызывать перегрузку сложения `полинома` с `термом`.
Для разбора на `термы` можно использовать самостоятельно разработанный вектор из предыдущей работы или динамический массив.

> ОСТОРОЖНО
>
> *В работе запрещено осуществлять парсинг конкретного `терма` в рамках `полинома`.
> Парсинг конкретного терма необходимо делегировать классу `Term`.
> Иными словами, полином должен только детектировать `термы` в строке.*

---

## Класс `Term`

**Общая характеристика**

Класс представляет одночлен вида:

```sh
ax^n
```

**Поля класса**

- `coef` — коэффициент;
- `power` — степень.

**Методы**

- Конструктор(ы)
   - без параметров, например для представления $0x^0$;
   - с одним параметром, например `3` -> $3x^0$;
   - с двумя параметрами, *например `3 2` -> $3x^2$*;
- Оператор сложения;
- Оператор ввода;
- Оператор вывода
   - $3x^0$ как `3`;
   - $3x^1$ как `3x`;
   - $1x^3$ как `x^3`;
   - $-3x^3$ как `-3x^3`.
-  Дружественный класс `Polynomial`.

Продемонстрируйте работу с классом `Term` в функции `main()` отдельно от `Polynomial`.

---

## Класс `Polynomial`

**Общая характеристика**

**Полином** — это сумма одночленов.

**Требования**

- Хранение в виде динамического массива или списка;
- Автоматическое упрощение (объединение одинаковых степеней);
- Сортировка по убыванию степеней.

**Методы**

- Добавление одночлена;
- Удаление одночлена;
- Приведение подобных членов;
- Вычисление значения при x.

**Операторы**

- `+` — сложение;
- `-` — вычитание;
- `*` — умножение;
- `==` — сравнение;
- `<<` — вывод.

---

## Пример

```cpp
Polynomial p1, p2;

p1.add(Term(2, 2));                       // 2x^2
p1.add(Term(3, 1));                       // 3x

p2.add(Term(1, 2));                       // x^2

Polynomial res = p1 + p2;

std::cout << res << std::endl;            // 3x^2 + 3x
```

---

## Требования к оформлению

- Код разбить на файлы:
  - Term.h / Term.cpp
  - Polynomial.h / Polynomial.cpp
  - main.cpp
- Реализовать перегрузку операторов.


---

## Контрольные вопросы

1. Что такое полином?
2. Как реализовать сложение полиномов?
3. Зачем нужна перегрузка операторов?
4. Как избежать дублирования степеней?
